<?php

declare(strict_types=1);

/*
 * This file is part of the LSP API and Panels projects
 *
 * Copyright (c) >= 2023 LSP
 *
 * file that was distributed with this source code.
 *
 * Feel free to edit as you please, and have fun.
 * Please follow OOP, SOLID and linux philosophy in development and becarefull about anti-patterns
 *
 * @CTO Mehrdad Dadkhah <dadkhah.ir@gmail.com>
 */

return [
    // Validations
    'username_format_invalid' => 'نام کاربری معتبر نیست. (باید با حرف انگلیسی شروع شود و فقط شامل حروف، اعداد و "_" باشد)',
    'mobile_invalid'          => 'شماره موبایل وارد شده معتبر نمی باشد.',
    'email_invalid'           => 'ایمیل وارد شده معتبر نمی باشد.',
    'identifier_required'     => 'وارد کردن نام کاربری، ایمیل یا موبایل الزامی می باشد.',
    'verification_failed'     => 'فرآیند تایید حساب انجام نشد، لطفا مجدد تلاش کنید.',
    'duplicated_mobile'       => 'این شماره موبایل قبلاً استفاده شده است.',

    'too_many_attempts'      => 'تعداد دفعات تلاش بیش از حد مجاز است. لطفاً مدتی صبر کنید و دوباره تلاش کنید.',
    'failed_process'         => 'یک مشکل فنی، در زیرساخت پلتفرم اتفاق افتاده است. لطفا چند دقیقه دیگر، مجدد تلاش کنید در صورت تکرار با پشتیبانی تماس بگیرید.',
    'access_error'           => 'شما دسترسی ندارید!',
    'basic_validation_error' => 'اطلاعات وارد شده نامعتبر است',
    'requested_enum_invalid' => 'آیتم خواسته شده پیدا نشد!',

    'auth_level_basic'   => 'برای فعال‌سازی پنل کاربری و دریافت تجربه بهتر، لطفا اطلاعات پایه خود را تکمیل کنید.',
    'auth_level_silver'  => 'برای مشاهده محتوای «[نام دوره]»، ضروری است احراز هویت را به سطح نقره‌ای ارتقا دهید.',
    'hash_id_is_invalid' => 'شناسه وارد شده معتبر نمی باشد.',

    'status_codes' => [
        'prefixes' => [
            100 => 'درخواست در حال پردازش است.',
            200 => 'درخواست با موفقیت انجام شد.',
            300 => 'در حال انتقال یا تغییر مسیر هستید.',
            400 => 'درخواست شما مشکلی دارد.',
            500 => 'متأسفانه خطایی در پلتفرم رخ داده است. چند دقیقه دیگر تلاش کنید.',
        ],

        'messages' => [
            100 => 'درخواست ادامه دارد، صبر کنید...',
            101 => 'در حال تغییر ارتباط (مثل سوییچ بین HTTP و WebSocket)',
            102 => 'در حال پردازش درخواست هستیم',
            103 => 'اطلاعات اولیه برای بارگذاری زودتر فرستاده شد',
            200 => 'همه‌چیز درست انجام شد',
            201 => 'درخواست شما با موفقیت ثبت شد',
            202 => 'درخواست دریافت شد، در حال بررسی است',
            203 => 'اطلاعات دریافت‌شده از منبع اصلی نیست و ممکن است تغییر یافته یا ناقص باشد',
            204 => 'درخواست انجام شد، ولی چیزی برای نمایش وجود ندارد',
            205 => 'فرم یا صفحه باید ریست شود',
            206 => 'بخشی از محتوا فرستاده شد',
            207 => 'پاسخ شامل چند وضعیت مختلف است',
            208 => 'این اطلاعات قبلاً ثبت شده',
            226 => 'اطلاعات از نسخه فشرده بازسازی شده',
            300 => 'چند گزینه برای ادامه دارید',
            301 => 'آدرس صفحه برای همیشه عوض شده',
            302 => 'صفحه به طور موقت به آدرس دیگری منتقل شده',
            303 => 'برای دیدن نتیجه به آدرس دیگری بروید',
            304 => 'محتوا تغییری نکرده، از همان نسخه قبلی استفاده کنید',
            305 => 'برای دیدن این صفحه باید از پروکسی خاصی استفاده کنید',
            307 => 'آدرس فعلاً عوض شده، بعداً ممکنه برگرده',
            308 => 'آدرس به‌طور دائمی تغییر یافته است و در آینده نیز همین‌ طور خواهد بود',
            400 => 'درخواست اشتباه بود، دوباره بررسی کنید',
            401 => 'برای ادامه باید وارد حساب خود شوید (Login)',
            402 => 'برای دسترسی باید هزینه پرداخت شود',
            403 => 'شما اجازه دیدن این صفحه را ندارید',
            404 => 'صفحه‌ای که دنبال آن هستید پیدا نشد',
            405 => 'این روش برای این آدرس مجاز نیست',
            406 => 'نوع اطلاعات دریافتی قابل قبول نیست',
            407 => 'نیاز به ورود از طریق پروکسی دارید',
            408 => 'مدت زمان پاسخگویی بیش از حد طولانی بود و درخواست متوقف شد',
            409 => 'درخواست شما با اطلاعات فعلی تداخل دارد',
            410 => 'محتوای موردنظر قبلاً وجود داشته ولی اکنون به‌صورت دائمی حذف شده است',
            411 => 'طول محتوا مشخص نیست، درخواست رد شد',
            412 => 'یکی از شرایط لازم برای ادامه برقرار نیست',
            413 => 'فایل یا اطلاعاتی که فرستادید خیلی بزرگ است',
            414 => 'آدرس اینترنتی (URL) خیلی طولانی است',
            415 => 'نوع فایل یا اطلاعات پشتیبانی نمی‌شود',
            416 => 'بخش درخواستی از فایل یا داده پیدا نشد',
            417 => 'انتظاری که در درخواست داشتید انجام نشد',
            418 => 'من یک قوری هستم! (کد شوخی برای خطا)',
            421 => 'درخواست شما به سرور اشتباهی فرستاده شده',
            422 => 'اطلاعاتی که فرستادید قابل پردازش نیست',
            423 => 'محتوا قفل شده و نمی‌شه تغییرش داد',
            424 => 'درخواست شما به یک بخش دیگر وابسته بود که انجام نشد',
            425 => 'درخواست خیلی زود فرستاده شده، فعلاً رد شد',
            426 => 'باید نرم‌افزار یا مرورگر خود را به نسخه جدید ارتقا دهید',
            428 => 'برای این درخواست باید شرط خاصی تعیین شود',
            429 => 'شما درخواست‌های زیادی پشت‌سر هم فرستادید. لطفاً کمی صبر کنید',
            431 => 'اطلاعات موجود در قسمت Header خیلی زیاد است',
            451 => 'این محتوا به دلایل قانونی قابل دسترسی نیست',
            500 => 'خطای داخلی سرور. مشکل از سمت سایت است',
            501 => 'این قابلیت هنوز پیاده‌سازی نشده',
            502 => 'پاسخ نامعتبر از سرور دیگر دریافت شد',
            503 => 'سایت موقتاً در دسترس نیست. لطفاً بعداً مراجعه کنید',
            504 => 'زمان پاسخ‌دهی سرور دیگر تمام شد',
            505 => 'نسخه HTTP که استفاده کردید پشتیبانی نمی‌شود',
            506 => 'سرور نمی‌تواند فرمت مناسب محتوا را بر اساس درخواست شما انتخاب کند',
            507 => 'فضای کافی برای ذخیره اطلاعات وجود ندارد',
            508 => 'درخواست باعث یک حلقه بی‌پایان شده',
            510 => 'برای دسترسی باید امکانات بیشتری فعال شود',
            511 => 'برای دسترسی به اینترنت باید وارد شبکه شوید (مثلاً Login در Wi-Fi)',
        ],
    ],
];
