<?php

declare(strict_types=1);

return [
    'category' => [
        'name_required'    => 'نام دسته‌بندی الزامی است.',
        'name_max'         => 'نام دسته‌بندی نباید بیشتر از ۱۵۰ کاراکتر باشد.',
        'slug_regex'       => 'نامک فقط می‌تواند شامل حروف کوچک انگلیسی، اعداد و خط تیره باشد.',
        'slug_unique'      => 'این نامک قبلاً استفاده شده است.',
        'parent_id_exists' => 'دسته‌بندی والد انتخاب شده معتبر نیست.',
    ],
    'custom_list_item' => [
        'attribute_id_required' => 'شناسه ویژگی الزامی است.',
        'attribute_id_exists'   => 'ویژگی انتخاب شده معتبر نیست.',
        'value_number_numeric'  => 'مقدار عددی وارد شده معتبر نیست.',
        'value_date_date'       => 'فرمت تاریخ وارد شده معتبر نیست.',
    ],
    'custom_list' => [
        'title_required'           => 'عنوان لیست الزامی است.',
        'title_max'                => 'عنوان لیست نباید بیشتر از ۲۵۵ کاراکتر باشد.',
        'slug_regex'               => 'نامک فقط می‌تواند شامل حروف کوچک انگلیسی، اعداد و خط تیره باشد.',
        'slug_unique'              => 'این نامک قبلاً استفاده شده است.',
        'attribute_label_required' => 'عنوان ویژگی الزامی است.',
        'attribute_key_required'   => 'نام کلیدی ویژگی الزامی است.',
        'attribute_key_regex'      => 'نام کلیدی فقط می‌تواند شامل حروف کوچک انگلیسی، اعداد و آندرلاین باشد.',
    ],
    'product' => [
        'title_required' => 'عنوان محصول الزامی است.',
        'title_max'      => 'عنوان محصول نباید بیشتر از ۲۵۵ کاراکتر باشد.',
        'slug_regex'     => 'نامک فقط می‌تواند شامل حروف کوچک انگلیسی، اعداد و خط تیره باشد.',
        'slug_unique'    => 'این نامک قبلاً استفاده شده است.',
        'price_required' => 'قیمت محصول الزامی است.',
        'price_min'      => 'قیمت محصول نمی‌تواند منفی باشد.',
        'sale_price_min' => 'قیمت تخفیف‌خورده نمی‌تواند منفی باشد.',
    ],
];
